---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassShade
source: html/75c08530-6404-75e6-eb36-729bd01fadf5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassShade Property

"Mass Shade"

## Syntax (C#)
```csharp
public static ForgeTypeId DefaultConstructionMassShade { get; }
```